Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་རྟག་པ་ཡང་མ་ཡིན། མི་རྟག་པ་ཡང་མ་ཡིན་ཏེ་ཅིར་ཡང་བརྗོད་པ་མ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་རྟག་པ་ཡང་མ་ཡིན། མི་རྟག་པ་ཡང་མ་ཡིན་ཏེ། ཅིར་ཡང་བརྗོད་པ་མ་ཡིན་ནོ། །
en: Śāntamati, just as space is neither permanent nor impermanent, and no one can describe it, in the same way, Śāntamati, the body of a realized one is neither permanent nor impermanent, and no one can describe it.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་སྦྱི་གཙུག་བལྟར་མི་མཐོང་བ་སྟེ།
en: “Śāntamati, no one can look down at the top of the head of the realized ones, the worthy ones, the perfect and complete buddhas.

source: ཞི་བའི་བློ་གྲོས་གང་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་མཐོང་བར་ནུས་པ་དེ་ནི་ཁོ་བོས་ལྷ་དང་བཅས་པ་དང་། བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ན་མ་མཐོང་ངོ་། །
en: Śāntamati, I have not seen anyone in this world with its gods, māras, Brahmās, ascetics, and brahmins, or anyone born among the gods, humans, or asuras, who has the capability to see the top of the head of a realized one.

source: ཞི་བའི་བློ་གྲོས་ཁོ་བོས་འདི་ལྟར་མངོན་པར་ཤེས་ཏེ། བཅོམ་ལྡན་འདས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་གྲོང་ཁྱེར་བཱ་ར་ཎཱ་སཱི་ན་དྲང་སྲོང་ལྷུང་བ་རི་དགས་ཀྱི་ནགས་ན་བཞུགས་པའི་དུས་གཅིག་ན་ཤར་ཕྱོགས་ལོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་དགྲ་འདུལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་ཞེས་བྱ་བ་དེ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་།
en: “Śāntamati, I know this: On one occasion not long after he had acquired complete and perfect awakening, the Blessed One was dwelling at Deer Park in Sage Landing in Vārāṇasī and turning the wheel of Dharma. At that time, a bodhisattva named Vegadhārin came from a world called Arindamāyā in the buddha domain of the realized one Campakavarṇa, in the eastern direction.

source: ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་འོངས་ཏེ།
en: He came to this Sahā world in order to see, venerate, and serve the Blessed One.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ །
en: He bowed his head at the feet of the Blessed One, walked around him seven times, keeping him on the right, and sat down before the Blessed One.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་འདི་སྙམ་དུ་སེམས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྤྱི་གཙུག་བལྟར་མི་མཐོང་ལ་སྐུ་ཚད་མེད་ཅིང་མཐའ་ཡས་ཀྱང་། བདག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཚད་དང་མཐའ་ཡོངས་སུ་བཙལ་བར་བྱའོ་སྙམ་མོ། །
en: Then, through the majestic power of the Buddha, the following thought occurred to the bodhisattva Vegadhārin: ‘Even though it is impossible to look down at the top of the head of blessed buddhas and their bodies are immeasurable and limitless, I would like to try and determine the limit and measure of the Realized One’s body.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་གིས་རང་གི་ལུས་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་བྱིན་གྱིས་བརླབས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་བལྟས་ནས་དེས་དེ་བཞིན་གཤེགས་པའི་སྐུ་དཔག་ཚད་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་པར་མཐོང་ནས་དེས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “The bodhisattva Vegadhārin then used his superhuman willpower so that his own body became eighty-four thousand leagues tall and he looked at the body of the Realized One and saw that it was six million eight hundred thousand leagues tall.

source: བདག་ནི་མངོན་པར་ཤེས་པ་ཐོབ་པ་རྫུ་འཕྲུལ་གྱི་རྐང་པས་རྣམ་པར་རྩེ་བ་ཡིན་གྱིས་བདག་གིས་དེ་བས་ཀྱང་རྒྱ་ཆེར་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཚད་བཙལ་བར་བྱའོ་སྙམ་ནས་དེ་སངས་རྒྱས་ཀྱི་མཐུ་དང་།
en: He had the thought, ‘I have acquired the supernormal faculties and made child’s play of the foundations for superhuman power.

source: རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པས་སྟེང་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བྱེ་བ་ཕྲག་བརྒྱའི་བྱེ་མ་སྙེད་འདས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ཅན་ཞེས་བྱ་བ་དེ་ན།
en: I would like to try and determine the measure of the Realized One’s body to an even greater extent.’ So, drawing on the majestic power of the Buddha and the power of his own superhuman abilities, he proceeded upward past as many buddha domains as there are grains of sand in a billion Ganges Rivers until he came to a world called Padmavatī where the realized one Padmaśrīrājagarbha still resides and teaches the Dharma.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་དཔལ་གྱི་རྒྱལ་པོའི་སྙིང་པོ་ཞེས་བྱ་བ་ད་ལྟ་ན་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། ཆོས་ཀྱང་སྟོན་པ་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་ཕྱིན་ནས་དེ་འཇིག་རྟེན་གྱི་ཁམས་དེར་གནས་ཀྱང་། དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་མཐོང་བར་མ་ནུས་ཤིང་།
en: Then, the bodhisattva Vegadhārin took a rest there, but even from his position in that world, he still could not look down at the top of the head of the Realized One.

source: དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཚད་དམ་མཐའ་ཡང་མ་དམིགས་སོ། །
en: Nor could he ascertain the limit or measure of the Blessed One’s body.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་དཔལ་གྱི་རྒྱལ་པོའི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་པད་མའི་དཔལ་གྱི་རྒྱལ་པོའི་སྙིང་པོ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་འདུག་སྟེ།
en: “The bodhisattva Vegadhārin then approached the realized one Padmaśrīrājagarbha, bowed his head at his feet, and walked around him seven times, keeping him on the right.

source: དེས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཐག་ཇི་སྲིད་ཅིག་ནས་མཆིས།
en: He then stood before the Blessed One, and he asked the Blessed One, ‘Blessed One, how far have I come from?’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་གཱའི་ཀླུང་བྱེ་བ་ཕྲག་བརྒྱའི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ནས་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་གིས་གསོལ་པ།
en: “ ‘Noble son,’ replied the Blessed One, ‘you have come to this world after passing buddha domains as numerous as there are grains of sand in a billion Ganges Rivers.’

source: བཅོམ་ལྡན་འདས་བདག་ཐག་རིང་མོ་ཞིག་ནས་མཆིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེའི་དབུའི་གཙུག་མཐོང་བར་ཡང་རྔོ་མ་ཐོག་ལ། སྐུའི་ཚད་དམ་མཐའ་རྟོགས་པར་ཡང་རྔོ་མ་ཐོག་ལགས་སོ། །
en: “The bodhisattva Vegadhārin said, ‘Blessed One, even though I have traveled so far, I am unable to look down at the top of the head of the Blessed One, Śākyamuni, or comprehend the limit or measure of his body.’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་གལ་ཏེ་ཤུགས་འདི་ཉིད་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་འདི་ཉིད་ཀྱིས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་སྟེང་གི་ཕྱོགས་ལོགས་སུ་སོང་དུ་ཟིན་ཀྱང་བཅོམ་ལྡན་འདས་དེའི་སྐུའི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །
en: “The Blessed One then told him, ‘Noble son, even if you used the power of your superhuman abilities and traveled upward at your top speed for as many eons as there are grains of sand in a billion Ganges Rivers, you would still not be able to comprehend the limit of the body of the Blessed One, Śākyamuni.

source: རིགས་ཀྱི་བུ་གང་ཡང་དཔེ་གཞག་པ་ཇི་སྙེད་པ་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དཔེར་བྱ་བ་འམ།
en: Noble son, suppose you were to devise analogies to describe the moral conduct of the Realized One;

source: ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དང་།
en: or analogies to describe his concentration, wisdom, liberation, and liberated knowledge and vision;

source: སྐུ་དང་གསུང་དང་ཐུགས་དང་།
en: or his body, speech, and mind;

source: གཟུགས་དང་མཚན་གྱི་དཔེར་བྱ་བའི་དཔེ་དགོད་པ་དེ་དག་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་བ་འདེབས་པའོ། །
en: or his physical form and marks.

source: དཔེ་གཅིག་ནི་མ་གཏོགས་ཏེ། འདི་ལྟར་དཔེ་ནམ་མཁའོ། །
en: Any and all the analogies you could devise would only denigrate the Realized One—that is, except for a single analogy: the analogy of space.

source: ནམ་མཁའ་ཇི་ཙམ་པར་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱང་དེ་ཙམ་མོ། །ཏིང་ངེ་འཛིན་ཀྱང་དེ་ཙམ་མོ། །
en: The Realized One’s moral conduct is vast as space.

source: ཤེས་རབ་ཀྱང་དེ་ཙམ་མོ། །རྣམ་པར་གྲོལ་བ་ཡང་དེ་ཙམ་མོ། །རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཡང་དེ་ཙམ་མོ། །
en: So, too, are his concentration, wisdom, liberation, and liberated knowledge and vision;

source: སྐུ་ཡང་དེ་ཙམ་མོ། །གསུང་ཡང་དེ་ཙམ་མོ། །ཐུགས་ཀྱང་དེ་ཙམ་མོ། །
en: his body, speech, and mind;

source: གཟུགས་ཀྱང་དེ་ཙམ་མོ། །མཚན་ཀྱང་དེ་ཙམ་མོ། །
en: and his physical form and marks.

source: དེ་བས་ན་ནམ་མཁའ་ཚད་མེད་པས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚད་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་བསྟན་ཏོ། །
en: Furthermore, since space is immeasurable, the body of the Realized One should also be understood as immeasurable.’

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་འཆང་གིས་བཅོམ་ལྡན་འདས་དེ་ལས་བསྟན་པ་འདི་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: “Śāntamati, the bodhisattva Vegadhārin was awestruck when he heard this teaching from the Blessed One.

source: ཚིམ་ཞིང་མགུལ་ཡི་རངས་ནས་རབ་ཏུ་དགའ་སྟེ།
en: Satisfied, overjoyed, pleased, and glad, he felt both delight and cheerfulness of mind.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཉིད་ནས་མི་སྣང་བར་གྱུར་པ་དང་།
en: He bowed his head at the feet of the Blessed One, walked around him seven times, keeping him on the right, and vanished from that buddha field.

source: སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་ཕྱིན་ཏེ།
en: With the majestic power of the Buddha and the power of his own superhuman abilities, he returned into the presence of the Blessed One Śākyamuni here in this Sahā world in the amount of time it takes to form a single thought.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: He bowed his head at the feet of the Blessed One, walked around him three times, keeping him on the right, and while standing before him with his palms placed together in salutation, he spoke the following verses:

source: ནམ་མཁའ་མཚུངས་ཤིང་འདྲ་བ་ཡི། །
en: “ ‘The one who wishes to reach

source: སངས་རྒྱས་ཆོས་ལ་མི་གང་ཞིག །
en: The other shore of the Buddha’s qualities,

source: ཕ་རོལ་ཏུ་ནི་མཆི་འཚལ་བ། །
en: The nature of which is similar to space,

source: དེ་ནི་ཉམ་ཐག་འགྱུར་བ་ལགས། །
en: Will run into an obstacle.

source: སངས་རྒྱས་སྐུ་ནི་བལྟ་སླད་དུ། །
en: “ ‘To see the limit of the Buddha’s body,

source: གང་གཱ་བྱེ་བ་ཕྲག་བརྒྱ་ཡི། །
en: I have gone to as many domains

source: བྱེ་མ་ཇི་སྙེད་དེ་སྙེད་ཀྱི། །
en: As there are grains of sand

source: ཞིང་རྣམས་སུ་ནི་བདག་མཆིས་སོ། །
en: In a billion Ganges Rivers.

source: དེ་སྙེད་ཞིང་དུ་མཆིས་ནས་ནི། །
en: “ ‘After passing through so many domains

source: པད་མ་ཅན་གྱི་ཞིང་དུ་མཆིས། །
en: I came to the world of Padmavatī.

source: འོན་ཀྱང་ཁྱོད་ཀྱི་དབུ་གཙུག་དང་། །
en: Yet, I did not see the top of your head,

source: སྐུ་ཡི་ཚད་ཀྱང་མ་མཐོང་ལགས། །
en: Nor have I taken the measure of your body.

source: ཞིང་དེ་ན་ནི་འདྲེན་བཞུགས་པ། །
en: “ ‘The guide of that domain,

source: མཚན་ནི་དཔལ་གྱི་སྙིང་པོ་ལགས། །
en: Whose name is Śrīgarbha,

source: དེ་ཡིས་བདག་གི་བསམ་མཁྱེན་ནས། །
en: Knowing my aspiration,

source: འདི་སྐད་དུ་ནི་བཀའ་སྩལ་ཏོ། །
en: Spoke these words:

source: ལ་ལས་སངས་རྒྱས་ཆོས་རྣམས་ལ། །
en: “ ‘ “Whichever analogy one makes up

source: དཔེ་དགོད་ཇི་སྙེད་བྱེད་པ་ནི། །
en: To describe a buddha’s qualities

source: དེ་དག་སངས་རྒྱས་མི་འཚམ་སྟེ། །
en: Is unsuitable for the Buddha;

source: དེ་དག་རྒྱལ་ལ་སྐུར་པ་འདེབས། །
en: It conveys a falsehood about the Victor.

source: འདི་ལ་དཔེ་གཅིག་ཡང་དག་སྟེ། །
en: “ ‘ “There is one true analogy:

source: ནམ་མཁའི་ཁམས་སུ་བསྟན་པ་ལགས། །
en: The element of space is taught to be

source: དེ་ནི་སངས་རྒྱས་ཆོས་དང་འཐུན། །
en: Equal to the qualities of a buddha,

source: གང་ན་འང་དེ་ཡི་ཚད་མ་མཆིས། །ནམ་མཁའ་འདི་ནི་ཇི་ཙམ་པར། །
en: Of which there is no measure anywhere.

source: སངས་རྒྱས་གྱི་ནི་ཚུལ་ཁྲིམས་དང་། །
en: “ ‘ “The extent of the Victor’s moral conduct,

source: ཏིང་ངེ་འཛིན་དང་རྣམ་གྲོལ་དང་། །
en: As well as his concentration, liberation,

source: རྣམ་གྲོལ་ཡེ་ཤེས་མཐོང་དེ་ཙམ། །
en: And his liberated knowledge and vision,

source: ནམ་མཁའི་ཚད་ནི་ཇི་ཙམ་པ། །
en: Is also equal to that of space. “ ‘ “Space has the very same measure

source: སངས་རྒྱས་གཟུགས་ཀྱང་དེ་ཙམ་སྟེ། །
en: As that of the Buddha’s form.

source: འཇིག་རྟེན་མགོན་པོའི་དབུ་གཙུག་ཀྱང་། །
en: For even the top of the Lord of the World’s head

source: ནམ་མཁའི་ཁམས་དང་མཚུངས་པ་ལགས། །
en: Is equal to the element of space.

source: ནམ་མཁས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: “ ‘ “Indeed, as far as the sky extends,

source: སྐུས་ཀྱང་དེ་སྙེད་ཁྱབ་པ་ལགས། །
en: That body extends that same distance.

source: སྐུ་ཡིས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: Indeed, as far as that body extends,

source: འོད་ཀྱིས་ཀྱང་ནི་དེ་སྙེད་ཁྱབ། །
en: Light extends that far, as well.

source: འོད་ཀྱིས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: “ ‘ “Moreover, as far as light extends,

source: གསུང་གིས་ཀྱང་ནི་དེ་སྙེད་ཁྱབ། །
en: The Mighty One’s speech extends that far.

source: གསུང་གིས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: As far as his speech extends,

source: ཐུགས་ཀྱིས་ཀྱང་ནི་དེ་སྙེད་ཁྱབ། །
en: The Guru’s mind extends, too.

source: ཐུགས་ཀྱིས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: “ ‘ “As far as the mind extends,

source: བྱམས་པས་ཀྱང་ནི་དེ་སྙེད་ཁྱབ། །
en: Love also extends that far.

source: བྱམས་པས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: As far as love extends,

source: ཡེ་ཤེས་ཀྱིས་ནི་དེ་སྙེད་ཁྱབ། །
en: Knowledge also extends that far.

source: ཡེ་ཤེས་ཇི་སྙེད་ཁྱབ་གྱུར་པ། །
en: “ ‘ “As far as knowledge extends,

source: སྐུ་ཡིས་ཀྱང་ནི་དེ་སྙེད་ཁྱབ། །
en: The body extends that far, too.

source: གང་གིས་བྱང་ཆུབ་བློ་བསྐྱེད་པ། །
en: One who produces the intent to awaken

source: དེ་སྙེད་བསོད་ནམས་ཁྱབ་པར་བགྱིད། །
en: Extends that far with one’s merit.

source: བྱང་ཆུབ་སེམས་ཀྱི་བསོད་ནམས་གང་། །
en: “ ‘ “If the merit from the aspiration for awakening

source: དེ་ལ་གལ་ཏེ་གཟུགས་མཆིས་ན། །
en: Were to take on a form,

source: ནམ་མཁའི་ཁམས་ནི་ཀུན་གང་སྟེ། །
en: It would fill the element of space

source: དེ་ནི་དེ་བས་ལྷག་པར་འགྱུར། །
en: And exceed even that.

source: སེམས་ཅན་ཀུན་གྱི་བསོད་ནམས་ཀྱི།
en: “ ‘ “Indeed, whatever quantity of merit Is possessed by all beings,

source: ཕུང་པོ་ཇི་སྙེད་ཡོངས་བཟུང་བ། །
en: It has all come into being

source: དེ་སྙེད་བྱང་ཆུབ་སེམས་དཔའ་ཡི། །
en: From the bodhisattva’s aspiration for awakening. “ ‘ “While, indeed, such a quantity

source: བྱང་ཆུབ་སེམས་ལས་རབ་ཏུ་བྱུང་། །བྱང་ཆུབ་སེམས་ཀྱི་བསོད་ནམས་ཀྱི། ཕུང་པོ་ཇི་སྙེད་བརྗོད་པ་བས། །
en: Of a bodhisattva’s merit is celebrated,

source: དམ་པའི་ཆོས་ནི་ཡོངས་འཛིན་ན། །
en: Grasping the true Dharma

source: དེ་བས་བསོད་ནམས་ཆེས་མང་ངོ་། །
en: Brings merit even greater than that.

source: དམ་ཆོས་འཛིན་པའི་བསོད་ནམས་ནི། །
en: “ ‘ “The merit from remembering the true Dharma

source: སངས་རྒྱས་ཀུན་གྱིས་ནན་ཏན་དུ། །
en: Could not be encapsulated to its full extent, Even if all the buddhas were to try to do so

source: བསྐལ་པ་བྱེ་བར་བརྗོད་མཛད་ཀྱང་། །
en: Over tens of millions of eons.

source: མཐའ་མར་ཕྱིན་པར་འགྱུར་མ་ལགས། །
en: “ ‘ “Yet, the merit from the aspiration for awakening

source: དམ་པའི་ཆོས་ནི་འཛིན་པ་དང་། །བྱང་ཆུབ་སེམས་ཀྱི་བསོད་ནམས་དེ། །
en: And that from comprehending the true Dharma

source: སྟོང་པ་ཉིད་ལ་མོས་པ་ཡི། །བཅུ་དྲུག་ཆ་ཡང་མི་རི་ལགས། །
en: Is not worth one sixteenth the value Of becoming ardently devoted to emptiness.

source: སྟོང་པ་ཉིད་ལ་འདིར་མོས་ནས། །
en: “ ‘ “Here, one who becomes devoted to emptiness

source: བྱང་ཆུབ་སེམས་ཀྱང་མི་གཏོང་དང་། །
en: Does not replace the aspiration for awakening,

source: དམ་པའི་ཆོས་ནི་འཛིན་བགྱིད་པ། །
en: But, verily, grasps on to the true Dharma,

source: དེ་ནི་བསོད་ནམས་སྡུད་པ་ལགས། །
en: And this is the collection of merit.

source: བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་པོ། །ཆོས་ཀྱི་རྟོགས་པ་འདི་ཐོས་ནས། །
en: “ ‘ “Acquiring this perspective on the Dharma, A bodhisattva achieves great renown,

source: དེ་ཡིས་བྱང་ཆུབ་སྤྱད་སྤྱོད་ཅིང་། །
en: Walks the path to awakening,

source: སངས་རྒྱས་ཡོན་ཏན་ཐོབ་པར་འགྱུར། །
en: And attains the qualities of a buddha.” ’

source: ཚིགས་སུ་བཅད་པ་བརྗོད་པ་ན། །
en: “When these verses were spoken,

source: ཞིང་རྣམས་བྱེ་བ་རབ་ཏུ་གཡོས། །
en: Millions of domains trembled,

source: ལྷ་ནི་བྱེ་བ་ཕྲག་སྟོང་གིས། །
en: And billions of gods played

source: རོལ་མོ་སིལ་སྙན་བྱེ་བ་བླངས། །
en: Tens of millions of musical instruments. “Billions of beings also conceived

source: སངས་རྒྱས་ཀྱི་ནི་ཆེ་བ་ཉིད། །
en: The aspiration for awakening

source: ཤུགས་འཆང་གིས་ནི་བཤད་ཐོས་ནས། །
en: When they heard Vegadhārin

source: སྲོག་ཆགས་བྱེ་བ་ཕྲག་སྟོང་དག །
en: Speak of the exalted state of the buddhas.

source: བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “Indeed, this is the inconceivable state,

source: སངས་རྒྱས་ཐམས་ཅད་གཟིགས་པ་པོ། །
en: The immeasurable, the unsurpassable,

source: རང་བྱུང་རྣམས་ཀྱི་གསང་བའི་གནས། །
en: The place of the secrets of the buddhas,

source: གནས་འདི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །
en: Who are all-seeing and self-arisen.

source: དཔག་ཡས་བླ་ན་མ་མཆིས་ལགས། །ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བའོ།། །།
en: “Śāntamati, this is the secret of the body of a realized one.

source: བམ་པོ་བཞི་པ། ཞི་བའི་བློ་གྲོས་དེ་ན་སེམས་ཅན་དུ་མ་འཁོར་གཅིག་ཏུ་འདུས་པ་དག་ལས་ཁ་ཅིག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་མ་མཐོང་ངོ་། །
en: In this regard, Śāntamati, among the beings who gather together in a single assembly, some see the body of a realized one and some do not.

source: དེ་ལ་གང་དག་གིས་མཐོང་བ་དེ་དག་ནི་དགའ་བ་སྐྱེས་ནས་ལྟའོ། །
en: Those who see him look upon him with delight.

source: གང་དག་གིས་མ་མཐོང་བ་དེ་དག་ནི་ཅང་མི་སྨྲ་བར་གྱུར་ཅིང་སྡོད་དོ། །
en: Those who do not see him wait there saying nothing.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་ནི་ཞལ་ཟས་མི་གསོལ་མོད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཞལ་ཟས་གསོལ་བར་མཐོང་ངོ་། །
en: “Moreover, Śāntamati, a realized one does not eat food, but beings see a realized one eating food.

source: ཞི་བའི་བློ་གྲོས་དེ་ལ་བྱང་ཆུབ་ཀྱི་རིམ་གྲོ་བའི་ལྷ་གཟི་བརྗིད་ཀྱི་སྟོབས་ཞེས་བྱ་བ་དག་རྟག་ཏུ་དེ་བཞིན་གཤེགས་པའི་ཞབས་འབྲིང་དུ་འབྲང་ཞིང་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཞལ་ཟས་སྣོད་དུ་ཟེད་ན་སེམས་ཅན་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པས་ཁམ་ཚད་དུ་བླངས་ཏེ་གསོལ་བར་མཐོང་ངོ་། །
en: In this respect, Śāntamati, there are gods, servants of awakening, who are called ‘those with the power of vitality,’ and they always follow along behind a realized one. They receive the food of a realized one with an alms bowl.

source: དེ་བཞིན་གཤེགས་པས་ཁམ་ཚད་དུ་བླངས་པ་དེ་ཡང་སྣོད་དེ་ཉིད་ན་འདུག་པ་དེ་ལྷ་དེ་དག་གིས་ཁྱེར་ནས་དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། ལས་ཀྱི་སྒྲིབ་པའི་དབང་གིས་སྐྱེ་གནས་དེ་དང་དེ་དག་ཏུ་འཕངས་པ། བཟའ་བ་དང་། བཏུང་བ་དང་། ཟས་མི་རྙེད་པ།
en: Beings see a realized one taking food, but the food that has been placed in that very alms bowl for the consumption of a realized one is taken by those gods so that they can distribute it as a donation to those beings in need of a realized one’s guidance, who previously established roots of virtue, but who now have been propelled through the force of their actions and hindrances into rebirths in various realms where they cannot obtain any food, drink, or other sustenance, and are therefore starving and experiencing weakness.

source: བཀྲེས་པས་ཉམ་ཆུང་བར་གྱུར་པ་ཇི་སྙེད་པ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་བཤོས་ཀྱི་ཕམ་བབས་དེ་བྱིན་ནས་སེམས་ཅན་དེ་དག་གིས་ཀྱང་ཟས་དེ་ཟོས་པ་དང་། བཀྲེས་སྐོམ་དང་བྲལ་ཏེ། བདེ་ཞིང་ལུས་ཚིམ་ནས་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: These beings consume the food and, their hunger abated and thirst slaked, they become at ease and their limbs feel good, and with ambition they conceive the aspiration for unsurpassable and perfect awakening, even those pretas dwelling in the world of Yama who have fallen into misfortune and are unable to conceive the aspiration for awakening.

source: གང་དག་ལོག་པར་ལྟུང་བ་ཡི་དགས་སམ་གཤིན་རྗེའི་འཇིག་རྟེན་ན་གནས་པ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མི་ནུས་པ་དེ་དག་ལ་ཡང་དེ་ཉིད་མྱ་ངན་ལས་འདས་པའི་བར་གྱི་རྒྱུར་འགྱུར་རོ། །
en: This very offering of food becomes the cause for them to do so until they reach complete cessation.

source: ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་ན་ཡང་ཁྱོད་ཀྱིས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཞལ་ཟས་མི་གསོལ་ཞིང་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཞལ་ཟས་ཅན་དུ་དེ་ལྟར་རིག་པར་བྱ་སྟེ།
en: “In precisely this way, Śāntamati, you should understand that a realized one does not eat food, but rather a realized one possesses the food of the Dharma.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་སྲེད་མེད་ཀྱི་བུ་ལྟར་མཁྲེགས་པ།
en: Indeed, Śāntamati, the body of a realized one is like that of a Nārāyaṇa.

source: སྲ་བ་སྙིང་པོ་ཅན། མི་ཤིགས་པ། རྡོ་རྗེའི་རང་བཞིན་ནོ། །
en: It is rock-solid, strong, unbreakable, and made of vajra.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ནི་ཕོ་བ་དང་ལོང་ཀ་མེད་དོ། །རྣག་གམ། ཁྲག་གམ། མཆི་མ་འམ། ངར་སྣབས་སམ།
en: Furthermore, Śāntamati, the body of the realized does not have a stomach or intestines, nor does it contain pus, blood, phlegm, snot, foulness, or excrement.

source: ངན་སྐྱུགས་སམ། མི་གཙང་བ་མེད་ཀྱི་ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་གར་བུ་ལྟ་བུ་སྟེ།
en: Śāntamati, the body of a realized is like a lump of gold from the Jambu River.

source: ཁོང་སྟོང་མ་ཡིན་པ། བུ་ག་མེད་པ།
en: It is not hollow;

source: ཁ་ན་མ་ཐོ་བ་མེད་པའོ། །
en: it has no openings or any imperfections.

source: ཞི་བའི་བློ་གྲོས་འདི་ལྟར་ལྕི་ཁྱད་རྡོ་རྗེ་དང་འདྲ་ཡང་འཇམ་ཁྱད་ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བར་འགྱུར་བས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆེ་བ་ཉིད་ལ་ལྟོས།
en: Look, Śāntamati, at the greatness of the Realized One’s body!

source: ཞི་བའི་བློ་གྲོས་གང་གི་ཚེ་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བའི་ལྷའི་བུ་རྣམས་དང་།
en: It is weighty and hard like vajra, but it is soft and pleasant to touch like the down of the kācalindika bird.

source: ལྷའི་བུ་མོ་རྣམས་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་ཕྱག་འཚལ་བ་ན། སྔོན་མ་རེག་པའི་རེག་པ་རེག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། །
en: “Śāntamati, when those deities and apsarases who possess truly great vitality pay homage at the feet of a realized one, then at that moment and time they feel something they have never felt before, they conceive the aspiration for unsurpassable and perfect awakening, and they do not produce any of the afflictions.

source: དེ་དག་ཉོན་མོངས་པ་སྐྱེད་པར་མི་འགྱུར་བའི་དུས་དེ་དང་ཚོད་དེ་ཡོད་དོ། །ཞི་བའི་བློ་གྲོས་སེམས་ཅན་འདོད་ཆགས་ལ་སྤྱོད་པ་གང་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་བ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་མ་ཐག་ཏུ་བདག་ཉིད་འདོད་ཆགས་དང་བྲལ་བར་ཤེས་སོ། །
en: Śāntamati, when beings engaged in lustful behavior see the body of a realized one, then just by seeing the body of a realized one they know themselves to be free from lust.

source: ཞེ་སྡང་ལ་སྤྱོད་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་བྱམས་པ་འཐོབ་བོ། །
en: When beings engaged in hate-filled behavior see the body of a realized one, they attain love.

source: གཏི་མུག་ལ་སྤྱོད་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཡེ་ཤེས་ཀྱི་སྣང་བ་འཐོབ་བོ། །
en: When beings engaged in ignorant behavior see it, they attain the light of knowledge.

source: ཆ་མཉམ་པ་ལ་སྤྱོད་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཉོན་མོངས་པ་དང་བྲལ་བར་ཤེས་སོ། །
en: When beings engaged in all three types of behavior to the same degree see it, they know themselves to be free from the afflictions.

source: སེར་སྣ་ཅན་གང་དག་གིས་མཐོང་ན་དེ་དག་གཏོང་བ་ལ་མོས་པར་འགྱུར་རོ། །
en: When beings who are miserly see it, they are inspired to give.

source: ཚུལ་ཁྲིམས་འཆལ་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཚུལ་ཁྲིམས་ལ་མོས་པར་འགྱུར་རོ། །
en: When beings who are morally undisciplined see it, they are inspired to become disciplined.

source: གནོད་སེམས་ཅན་གང་དག་གིས་མཐོང་ན་དེ་དག་བཟོད་པ་འཐོབ་བོ། །
en: When beings who possess malicious thoughts see it, they attain patient acceptance.

source: ལེ་ལོ་ཅན་གང་དག་གིས་མཐོང་ན་དེ་དག་བརྩོན་འགྲུས་ལ་མོས་པར་འགྱུར་རོ། །
en: When those who are lazy see it, they are inspired to put forth heroic effort.

source: སེམས་གཡེང་བ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཏིང་ངེ་འཛིན་འཐོབ་བོ། །
en: When those who are distracted see it, they attain concentration.

source: ཤེས་རབ་འཆལ་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཤེས་རབ་ལ་མོས་པར་འགྱུར་རོ། །
en: When those with poor discernment see it, they are inspired to attain wisdom.
